This is Pandas Library Practice file

In [2]:
import numpy as np
import pandas as pd

In [67]:
daf={'rohan': 19, 'tushar': 25, 'hemant': 17}

In [68]:
pd.Series(daf)

rohan     19
tushar    25
hemant    17
dtype: int64

In [75]:
df=pd.read_csv('Files/tips.csv')
df

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251
...,...,...,...,...,...,...,...,...,...,...,...
239,29.03,5.92,Male,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842,Sat2657
240,27.18,2.00,Female,Yes,Sat,Dinner,2,13.59,Monica Sanders,3506806155565404,Sat1766
241,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196,Sat3880
242,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950,Sat17
243,18.78,3.00,Female,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139,Thur672

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 11 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   total_bill        244 non-null    float64
 1   tip               244 non-null    float64
 2   sex               244 non-null    object
 3   smoker            244 non-null    object
 4   day               244 non-null    object
 5   time              244 non-null    object
 6   size              244 non-null    int64
 7   price_per_person  244 non-null    float64
 8   Payer Name        244 non-null    object
 9   CC Number         244 non-null    int64
 10  Payment ID        244 non-null    object
dtypes: float64(3), int64(2), object(6)
memory usage: 21.1+ KB

In [8]:
df.columns

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size',
       'price_per_person', 'Payer Name', 'CC Number', 'Payment ID'],
      dtype='object')

In [13]:
df.tail(7)

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
237,32.83,1.17,Male,Yes,Sat,Dinner,2,16.42,Thomas Brown,4284722681265508,Sat2929
238,35.83,4.67,Female,No,Sat,Dinner,3,11.94,Kimberly Crane,676184013727,Sat9777
239,29.03,5.92,Male,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842,Sat2657
240,27.18,2.00,Female,Yes,Sat,Dinner,2,13.59,Monica Sanders,3506806155565404,Sat1766
241,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196,Sat3880
242,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950,Sat17
243,18.78,3.00,Female,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139,Thur672

In [14]:
df.tail()

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
239,29.03,5.92,Male,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842,Sat2657
240,27.18,2.00,Female,Yes,Sat,Dinner,2,13.59,Monica Sanders,3506806155565404,Sat1766
241,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196,Sat3880
242,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950,Sat17
243,18.78,3.00,Female,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139,Thur672

In [76]:
df['total_bill']

0      16.99
1      10.34
2      21.01
3      23.68
4      24.59
       ...
239    29.03
240    27.18
241    22.67
242    17.82
243    18.78
Name: total_bill, Length: 244, dtype: float64

In [22]:
df[['Payer Name','total_bill']]

             Payer Name  total_bill
0    Christy Cunningham       16.99
1        Douglas Tucker       10.34
2        Travis Walters       21.01
3      Nathaniel Harris       23.68
4          Tonya Carter       24.59
..                  ...         ...
239       Michael Avila       29.03
240      Monica Sanders       27.18
241          Keith Wong       22.67
242        Dennis Dixon       17.82
243     Michelle Hardin       18.78

[244 rows x 2 columns]

In [23]:
df[['Payer Name','total_bill']].head(10)

           Payer Name  total_bill
0  Christy Cunningham       16.99
1      Douglas Tucker       10.34
2      Travis Walters       21.01
3    Nathaniel Harris       23.68
4        Tonya Carter       24.59
5          Erik Smith       25.29
6  Kristopher Johnson        8.77
7         Robert Buck       26.88
8     Joseph Mcdonald       15.04
9       Jerome Abbott       14.78

In [24]:
df[['Payer Name','total_bill']].max()

Payer Name    William Roth
total_bill           50.81
dtype: object

In [28]:
df[['Payer Name','total_bill']].min()

Payer Name    Aaron Bentley
total_bill             3.07
dtype: object

In [29]:
df[['Payer Name','tip']]

             Payer Name   tip
0    Christy Cunningham  1.01
1        Douglas Tucker  1.66
2        Travis Walters  3.50
3      Nathaniel Harris  3.31
4          Tonya Carter  3.61
..                  ...   ...
239       Michael Avila  5.92
240      Monica Sanders  2.00
241          Keith Wong  2.00
242        Dennis Dixon  1.75
243     Michelle Hardin  3.00

[244 rows x 2 columns]

In [32]:
df[['Payer Name','tip']].head()

           Payer Name   tip
0  Christy Cunningham  1.01
1      Douglas Tucker  1.66
2      Travis Walters  3.50
3    Nathaniel Harris  3.31
4        Tonya Carter  3.61

In [38]:
df[['Payer Name','tip']].max()

Payer Name    William Roth
tip                   10.0
dtype: object

In [84]:
df['smoker'].value_counts()

smoker
No     151
Yes     93
Name: count, dtype: int64

In [90]:
df['day'].value_counts()

day
Sat     87
Sun     76
Thur    62
Fri     19
Name: count, dtype: int64

In [108]:
newdf=pd.read_csv('weather_data.csv')
newdf.set_index('day',inplace=True)
newdf

           temperature  windspeed   event
day
1/1/2017          32.0        6.0    Rain
1/4/2017           NaN        9.0   Sunny
1/5/2017          28.0        NaN    Snow
1/6/2017           NaN        7.0     NaN
1/7/2017          32.0        NaN    Rain
1/8/2017           NaN        NaN   Sunny
1/9/2017           NaN        NaN     NaN
1/10/2017         34.0        8.0  Cloudy
1/11/2017         40.0       12.0   Sunny

In [109]:
ndf=newdf.fillna(method='bfill')
ndf

C:\Users\Abhishek-PC\AppData\Local\Temp\ipykernel_18252\3375367504.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  ndf=newdf.fillna(method='bfill')

           temperature  windspeed   event
day
1/1/2017          32.0        6.0    Rain
1/4/2017          28.0        9.0   Sunny
1/5/2017          28.0        7.0    Snow
1/6/2017          32.0        7.0    Rain
1/7/2017          32.0        8.0    Rain
1/8/2017          34.0        8.0   Sunny
1/9/2017          34.0        8.0  Cloudy
1/10/2017         34.0        8.0  Cloudy
1/11/2017         40.0       12.0   Sunny

In [111]:
newdf.dropna()

           temperature  windspeed   event
day
1/1/2017          32.0        6.0    Rain
1/10/2017         34.0        8.0  Cloudy
1/11/2017         40.0       12.0   Sunny

In [112]:
nd=newdf.dropna(how="all")
nd

           temperature  windspeed   event
day
1/1/2017          32.0        6.0    Rain
1/4/2017           NaN        9.0   Sunny
1/5/2017          28.0        NaN    Snow
1/6/2017           NaN        7.0     NaN
1/7/2017          32.0        NaN    Rain
1/8/2017           NaN        NaN   Sunny
1/10/2017         34.0        8.0  Cloudy
1/11/2017         40.0       12.0   Sunny

In [114]:
avg_temp=nd['temperature'].mean(axis=0)
avg_temp

33.2

In [115]:
avg_wind=nd['windspeed'].mean(axis=0)
avg_wind

8.4

In [117]:
nd['temperature'].replace(np.nan, avg_temp, inplace=True)
nd

C:\Users\Abhishek-PC\AppData\Local\Temp\ipykernel_18252\54058026.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  nd['temperature'].replace(np.nan, avg_temp, inplace=True)
C:\Users\Abhishek-PC\AppData\Local\Temp\ipykernel_18252\54058026.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  nd['temperature'].replace(np.nan, avg_temp, inplace=True)

           temperature  windspeed   event
day
1/1/2017          32.0        6.0    Rain
1/4/2017          33.2        9.0   Sunny
1/5/2017          28.0        NaN    Snow
1/6/2017          33.2        7.0     NaN
1/7/2017          32.0        NaN    Rain
1/8/2017          33.2        NaN   Sunny
1/10/2017         34.0        8.0  Cloudy
1/11/2017         40.0       12.0   Sunny

In [118]:
nd['windspeed'].replace(np.nan,avg_wind, inplace=True)
nd

C:\Users\Abhishek-PC\AppData\Local\Temp\ipykernel_18252\1646802307.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  nd['windspeed'].replace(np.nan,avg_wind, inplace=True)
C:\Users\Abhishek-PC\AppData\Local\Temp\ipykernel_18252\1646802307.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  nd['windspeed'].replace(np.nan,avg_wind, inplace=True)

           temperature  windspeed   event
day
1/1/2017          32.0        6.0    Rain
1/4/2017          33.2        9.0   Sunny
1/5/2017          28.0        8.4    Snow
1/6/2017          33.2        7.0     NaN
1/7/2017          32.0        8.4    Rain
1/8/2017          33.2        8.4   Sunny
1/10/2017         34.0        8.0  Cloudy
1/11/2017         40.0       12.0   Sunny

In [119]:
nd['event'].value_counts()

event
Sunny     3
Rain      2
Snow      1
Cloudy    1
Name: count, dtype: int64

In [120]:
nd['event'].value_counts().idxmax()

'Sunny'

In [121]:
nd['event'].replace(np.nan,'Sunny',inplace=True)
nd

C:\Users\Abhishek-PC\AppData\Local\Temp\ipykernel_18252\2009663101.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  nd['event'].replace(np.nan,'Sunny',inplace=True)
C:\Users\Abhishek-PC\AppData\Local\Temp\ipykernel_18252\2009663101.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  nd['event'].replace(np.nan,'Sunny',inplace=True)

           temperature  windspeed   event
day
1/1/2017          32.0        6.0    Rain
1/4/2017          33.2        9.0   Sunny
1/5/2017          28.0        8.4    Snow
1/6/2017          33.2        7.0   Sunny
1/7/2017          32.0        8.4    Rain
1/8/2017          33.2        8.4   Sunny
1/10/2017         34.0        8.0  Cloudy
1/11/2017         40.0       12.0   Sunny

#### Group BY

In [123]:
wdf=pd.read_csv('weather_by_cities.csv')
wdf

         day      city  temperature  windspeed   event
0   1/1/2017  new york           32          6    Rain
1   1/2/2017  new york           36          7   Sunny
2   1/3/2017  new york           28         12    Snow
3   1/4/2017  new york           33          7   Sunny
4   1/1/2017    mumbai           90          5   Sunny
5   1/2/2017    mumbai           85         12     Fog
6   1/3/2017    mumbai           87         15     Fog
7   1/4/2017    mumbai           92          5    Rain
8   1/1/2017     paris           45         20   Sunny
9   1/2/2017     paris           50         13  Cloudy
10  1/3/2017     paris           54          8  Cloudy
11  1/4/2017     paris           42         10  Cloudy

In [135]:
g= wdf.groupby('city')
g

In [126]:
for city, city_df in g:
    print(city)
    print(city_df)

mumbai
        day    city  temperature  windspeed  event
4  1/1/2017  mumbai           90          5  Sunny
5  1/2/2017  mumbai           85         12    Fog
6  1/3/2017  mumbai           87         15    Fog
7  1/4/2017  mumbai           92          5   Rain
new york
        day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny
paris
         day   city  temperature  windspeed   event
8   1/1/2017  paris           45         20   Sunny
9   1/2/2017  paris           50         13  Cloudy
10  1/3/2017  paris           54          8  Cloudy
11  1/4/2017  paris           42         10  Cloudy

In [127]:
g.get_group('mumbai')

        day    city  temperature  windspeed  event
4  1/1/2017  mumbai           90          5  Sunny
5  1/2/2017  mumbai           85         12    Fog
6  1/3/2017  mumbai           87         15    Fog
7  1/4/2017  mumbai           92          5   Rain

In [128]:
g.max()

               day  temperature  windspeed  event
city
mumbai    1/4/2017           92         15  Sunny
new york  1/4/2017           36         12  Sunny
paris     1/4/2017           54         20  Sunny

In [131]:
g.min()

               day  temperature  windspeed   event
city
mumbai    1/1/2017           85          5     Fog
new york  1/1/2017           28          6    Rain
paris     1/1/2017           42          8  Cloudy

In [139]:
g.describe()

         temperature                                                   \
               count   mean       std   min    25%   50%    75%   max
city
mumbai           4.0  88.50  3.109126  85.0  86.50  88.5  90.50  92.0
new york         4.0  32.25  3.304038  28.0  31.00  32.5  33.75  36.0
paris            4.0  47.75  5.315073  42.0  44.25  47.5  51.00  54.0

         windspeed
             count   mean       std  min   25%   50%    75%   max
city
mumbai         4.0   9.25  5.057997  5.0  5.00   8.5  12.75  15.0
new york       4.0   8.00  2.708013  6.0  6.75   7.0   8.25  12.0
paris          4.0  12.75  5.251984  8.0  9.50  11.5  14.75  20.0

In [141]:
india_weather = pd.DataFrame({
    "city": ["mumbai","delhi","banglore"],
    "temperature": [32,45,30],
    "humidity": [80, 60, 78]
})
india_weather

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78

In [142]:
us_weather = pd.DataFrame({
    "city": ["new york","chicago","orlando"],
    "temperature": [21,14,35],
    "humidity": [68, 65, 75]
})
us_weather

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [143]:
cdf=pd.concat([india_weather, us_weather])
cdf

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [144]:
cdf=pd.concat([india_weather, us_weather], ignore_index=True)
cdf

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78
3  new york           21        68
4   chicago           14        65
5   orlando           35        75

In [148]:
temprature_df = pd.DataFrame({
    "city": ["mumbai","delhi","banglore"],
    "temperature": [32,45,30],
}, index=[0,1,2])
temprature_df

       city  temperature
0    mumbai           32
1     delhi           45
2  banglore           30

In [152]:
windspeed_df = pd.DataFrame({
    "city": ["delhi","mumbai","banglore"],
    "windspeed": [7,12,9],
}, index=[1,0,2])
windspeed_df

       city  windspeed
1     delhi          7
0    mumbai         12
2  banglore          9

In [153]:
ccdf=pd.concat([temprature_df,windspeed_df], axis=1)
ccdf

       city  temperature      city  windspeed
0    mumbai           32    mumbai         12
1     delhi           45     delhi          7
2  banglore           30  banglore          9

In [154]:
mdf=pd.merge(temperature_df,windspeed_df,on='city' )
mdf

       city  temperature  windspeed
0    mumbai           32         12
1     delhi           45          7
2  banglore           30          9

In [159]:
pdf=wdf.drop('event', axis=1)
pdf

         day      city  temperature  windspeed
0   1/1/2017  new york           32          6
1   1/2/2017  new york           36          7
2   1/3/2017  new york           28         12
3   1/4/2017  new york           33          7
4   1/1/2017    mumbai           90          5
5   1/2/2017    mumbai           85         12
6   1/3/2017    mumbai           87         15
7   1/4/2017    mumbai           92          5
8   1/1/2017     paris           45         20
9   1/2/2017     paris           50         13
10  1/3/2017     paris           54          8
11  1/4/2017     paris           42         10

In [169]:
pdf['day']=pd.to_datetime(pdf['day'])
pdf

          day      city  temperature  windspeed
0  2017-01-01  new york           32          6
1  2017-01-02  new york           36          7
2  2017-01-03  new york           28         12
3  2017-01-04  new york           33          7
4  2017-01-01    mumbai           90          5
5  2017-01-02    mumbai           85         12
6  2017-01-03    mumbai           87         15
7  2017-01-04    mumbai           92          5
8  2017-01-01     paris           45         20
9  2017-01-02     paris           50         13
10 2017-01-03     paris           54          8
11 2017-01-04     paris           42         10

In [161]:
pdf.pivot_table(index='city', columns='day')

         temperature                            windspeed                    \
day         1/1/2017 1/2/2017 1/3/2017 1/4/2017  1/1/2017 1/2/2017 1/3/2017
city
mumbai          90.0     85.0     87.0     92.0       5.0     12.0     15.0
new york        32.0     36.0     28.0     33.0       6.0      7.0     12.0
paris           45.0     50.0     54.0     42.0      20.0     13.0      8.0


day      1/4/2017
city
mumbai        5.0
new york      7.0
paris        10.0

In [164]:
pdf.pivot_table(index='city', columns='day', aggfunc='sum')

         temperature                            windspeed                    \
day         1/1/2017 1/2/2017 1/3/2017 1/4/2017  1/1/2017 1/2/2017 1/3/2017
city
mumbai            90       85       87       92         5       12       15
new york          32       36       28       33         6        7       12
paris             45       50       54       42        20       13        8


day      1/4/2017
city
mumbai          5
new york        7
paris          10

In [165]:
pdf.pivot_table(index='city', columns='day', margins=True)

         temperature                                            windspeed  \
day         1/1/2017 1/2/2017   1/3/2017   1/4/2017        All   1/1/2017
city
mumbai     90.000000     85.0  87.000000  92.000000  88.500000   5.000000
new york   32.000000     36.0  28.000000  33.000000  32.250000   6.000000
paris      45.000000     50.0  54.000000  42.000000  47.750000  20.000000
All        55.666667     57.0  56.333333  55.666667  56.166667  10.333333


day        1/2/2017   1/3/2017   1/4/2017    All
city
mumbai    12.000000  15.000000   5.000000   9.25
new york   7.000000  12.000000   7.000000   8.00
paris     13.000000   8.000000  10.000000  12.75
All       10.666667  11.666667   7.333333  10.00